"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 
"""
number = int(input("Введите трехзначное число: "))
print(number, '->', number//100+number//10 % 10+number % 10)

"""
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
Вместе они сделали S журавликов. Сколько журавликов сделал 
каждый ребенок, если известно, что Петя и Сережа сделали 
одинаковое количество журавликов, а Катя сделала в два раза 
больше журавликов, чем Петя и Сережа вместе?
*Пример:*

6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10
    """
s = int(input("Введите общее число журавликов: "))
if s%6 == 0:
    a = s//6
    b = 4*s//6
    c = s//6
    print(s, '->', a, b, c)
else:
    print('с таким значением задача не может быть решена в целых числах')

"""
Задача 6: Вы пользуетесь общественным транспортом? 
Вероятно, вы расплачивались за проезд и получали билет с номером.
 Счастливым билетом называют такой билет с шестизначным номером, 
 где сумма первых трех цифр равна сумме последних трех. 
 Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
 Вам требуется написать программу, которая проверяет 
 счастливость билета.
*Пример:*

385916 -> yes
123456 -> no
"""

ticket = input("Введите 6-значный номер билета: ")
if len(ticket) != 6:
    print('Ошибка ввода числа')
else:
    res1 = 0
    res2 = 0
    for i in range(len(ticket)//2):
        res1 += int(ticket[i])
        res2 += int(ticket[len(ticket)//2 + i])
    luck = res1 == res2
    print(ticket, '->', luck)

'''
Задача 8: Требуется определить, можно ли от шоколадки размером 
n × m долек отломить k долек, если разрешается сделать один разлом 
по прямой между дольками (то есть разломить шоколадку на два 
прямоугольника).
*Пример:*

3 2 4 -> yes
3 2 1 -> no
'''
n = int(input("Введите длину шоколадки: "))
m = int(input("Введите ширину шоколадки: "))
k = int(input("Сколько долек хотите отломить? "))
if k % n == 0 or k % m == 0:
    print('yes')
else:
    print('no')
    